hound/ALERT.KEUI.Response#similarThreads.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <s:Header></s:Header>
    <s:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/keui</wsa:Address>
                </wsnt:ProducerReference>
				<wsnt:Message>
		            <ns1:event xmlns:ns1="http://www.alert-project.eu/"	xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"	xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
		                <ns1:head>
		                    <ns1:sender>KEUITest</ns1:sender>
		                    <ns1:timestamp>1332400355</ns1:timestamp>
		                    <ns1:sequencenumber>85d7e942-146e-4ba5-9c4b-ec34f27ca4d5</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
			                <ns1:meta>
			                    <ns1:startTime>1332400355</ns1:startTime>
								<ns1:endTime>1332400355</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.KEUIResponse</ns1:eventName>
								<ns1:eventId>???</ns1:eventId>
								<ns1:eventType>???</ns1:eventType>
			                </ns1:meta>
			                <ns1:eventData>
			                    <s1:keuiRequest>
			                    	<s1:requestType>CustomQuery</s1:requestType>
			                        <s1:requestData><query type="similarThreads" threadId="1" count="100" includeItemIds="1" ></query></s1:requestData>
								</s1:keuiRequest>
		<s1:keuiResponse><results>
<similarities>
<thread id="48" sim="0.6137"  itemIds="94,95,96" />
<thread id="170" sim="0.5984"  itemIds="400,401,402" />
<thread id="154" sim="0.5013"  itemIds="360,361,362" />
<thread id="118" sim="0.4971"  itemIds="291,292,293" />
<thread id="222" sim="0.4943"  itemIds="515,516,517,518,519" />
<thread id="41" sim="0.4811"  itemIds="82,83,84" />
<thread id="36" sim="0.4693"  itemIds="69,70" />
<thread id="229" sim="0.4320"  itemIds="533,534" />
<thread id="155" sim="0.4213"  itemIds="363,364,365" />
<thread id="306" sim="0.3875"  itemIds="688,689,690" />
<thread id="186" sim="0.3820"  itemIds="433,434,435,436" />
<thread id="305" sim="0.3537"  itemIds="683,684,685,686,687" />
<thread id="281" sim="0.3472"  itemIds="640,641,642" />
<thread id="289" sim="0.3149"  itemIds="657,658" />
<thread id="258" sim="0.3129"  itemIds="597,598" />
<thread id="68" sim="0.3010"  itemIds="132,133,134" />
<thread id="163" sim="0.2120"  itemIds="380,381,382,383,384,385" />
<thread id="150" sim="0.2098"  itemIds="354,355" />
<thread id="221" sim="0.1831"  itemIds="508,509,510,511,512,513,514" />
<thread id="249" sim="0.1652"  itemIds="580,581" />
<thread id="138" sim="0.1593"  itemIds="328,329" />
<thread id="264" sim="0.1230"  itemIds="606,607,608" />
<thread id="94" sim="0.1180"  itemIds="246,247" />
<thread id="161" sim="0.1098"  itemIds="376,377,378" />
<thread id="119" sim="0.1088"  itemIds="294" />
<thread id="40" sim="0.1051"  itemIds="80,81" />
<thread id="5" sim="0.0919"  itemIds="10" />
<thread id="56" sim="0.0881"  itemIds="109,110" />
<thread id="193" sim="0.0865"  itemIds="450,451,452" />
<thread id="61" sim="0.0776"  itemIds="118,119" />
<thread id="60" sim="0.0776"  itemIds="116,117" />
<thread id="125" sim="0.0704"  itemIds="304,305,306" />
<thread id="7" sim="0.0696"  itemIds="12" />
<thread id="46" sim="0.0693"  itemIds="91,92" />
<thread id="22" sim="0.0683"  itemIds="42,43" />
<thread id="290" sim="0.0676"  itemIds="659,660" />
<thread id="82" sim="0.0670"  itemIds="167,168" />
<thread id="177" sim="0.0664"  itemIds="414,415" />
<thread id="141" sim="0.0662"  itemIds="334,335,336" />
<thread id="148" sim="0.0649"  itemIds="348" />
<thread id="16" sim="0.0641"  itemIds="35" />
<thread id="256" sim="0.0637"  itemIds="593,594" />
<thread id="117" sim="0.0635"  itemIds="289,290" />
<thread id="230" sim="0.0632"  itemIds="535" />
<thread id="14" sim="0.0622"  itemIds="30,31,32,33" />
<thread id="30" sim="0.0607"  itemIds="56,57" />
<thread id="291" sim="0.0596"  itemIds="661,662" />
<thread id="307" sim="0.0596"  itemIds="691,692" />
<thread id="159" sim="0.0588"  itemIds="372" />
<thread id="192" sim="0.0580"  itemIds="447,448,449" />
<thread id="88" sim="0.0578"  itemIds="235,236" />
<thread id="77" sim="0.0571"  itemIds="151,152,153" />
<thread id="13" sim="0.0565"  itemIds="25,26,27,28,29" />
<thread id="115" sim="0.0564"  itemIds="284,285,286" />
<thread id="227" sim="0.0557"  itemIds="529,530" />
<thread id="146" sim="0.0552"  itemIds="343,344,345,346" />
<thread id="18" sim="0.0546"  itemIds="37" />
<thread id="276" sim="0.0545"  itemIds="629,630" />
<thread id="93" sim="0.0544"  itemIds="243,244,245" />
<thread id="198" sim="0.0541"  itemIds="459,460" />
<thread id="224" sim="0.0530"  itemIds="523,524,525" />
<thread id="102" sim="0.0522"  itemIds="259,260,261,262" />
<thread id="9" sim="0.0521"  itemIds="16" />
<thread id="109" sim="0.0508"  itemIds="272,273,274" />
<thread id="8" sim="0.0507"  itemIds="13,14,15" />
<thread id="254" sim="0.0503"  itemIds="589,590" />
<thread id="134" sim="0.0500"  itemIds="321,322,323" />
<thread id="19" sim="0.0500"  itemIds="38" />
<thread id="27" sim="0.0488"  itemIds="52" />
<thread id="302" sim="0.0488"  itemIds="679,680" />
<thread id="78" sim="0.0482"  itemIds="154,155,156" />
<thread id="140" sim="0.0480"  itemIds="331,332,333" />
<thread id="63" sim="0.0477"  itemIds="122,123" />
<thread id="2" sim="0.0473"  itemIds="6,7" />
<thread id="23" sim="0.0469"  itemIds="44,45" />
<thread id="313" sim="0.0467"  itemIds="701,702" />
<thread id="3" sim="0.0465"  itemIds="8" />
<thread id="33" sim="0.0465"  itemIds="65" />
<thread id="270" sim="0.0463"  itemIds="617,618" />
<thread id="79" sim="0.0455"  itemIds="157" />
<thread id="101" sim="0.0452"  itemIds="256,257,258" />
<thread id="69" sim="0.0443"  itemIds="135,136" />
<thread id="255" sim="0.0440"  itemIds="591,592" />
<thread id="223" sim="0.0437"  itemIds="520,521,522" />
<thread id="167" sim="0.0430"  itemIds="395,396" />
<thread id="6" sim="0.0429"  itemIds="11" />
<thread id="286" sim="0.0427"  itemIds="652,653" />
<thread id="95" sim="0.0426"  itemIds="248,249" />
<thread id="252" sim="0.0426"  itemIds="585,586" />
<thread id="285" sim="0.0425"  itemIds="650,651" />
<thread id="75" sim="0.0407"  itemIds="147,148,149" />
<thread id="0" sim="0.0407"  itemIds="1,2" />
<thread id="15" sim="0.0404"  itemIds="34" />
<thread id="241" sim="0.0403"  itemIds="565,566,567,568" />
<thread id="157" sim="0.0402"  itemIds="368,369,370" />
<thread id="124" sim="0.0401"  itemIds="300,301,302,303" />
<thread id="188" sim="0.0398"  itemIds="438" />
<thread id="194" sim="0.0397"  itemIds="453" />
<thread id="244" sim="0.0392"  itemIds="573,574" />
<thread id="26" sim="0.0383"  itemIds="51" />
</similarities>
</results>

		</s1:keuiResponse>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
    </s:Body>
</s:Envelope>